import matplotlib.pyplot as plt
import numpy as np

dots0 = [
    (100, 0.0034) ,
    (200, 0.0342) ,
    (300, 0.1166) ,
    (400, 0.3) ,
    (500, 0.5932) ,
    (600, 1.0246) ,
    (700, 1.6994) ,
    (800, 2.741) ,
    (900, 3.555) ,
    (1000, 6.3508) 
        ]

dots1 = [
    (100, 0.003081) ,
    (200, 0.017935) ,
    (300, 0.060187) ,
    (400, 0.147865) ,
    (500, 0.303851) ,
    (600, 0.522693) ,
    (700, 1.011488) ,
    (800, 2.242391) ,
    (900, 3.420057) ,
    (1000, 4.600930)
         ]

dots2 = [
    (100, 0.001769) ,
    (200, 0.012497) ,
    (300, 0.038416) ,
    (400, 0.104420) ,
    (500, 0.366667) ,
    (600, 0.539186) ,
    (700, 0.901877) ,
    (800, 1.308702) ,
    (900, 1.861985) ,
    (1000, 3.064027) 
    
        ]

dots3 = [
    (100, 0.003124) ,
    (200, 0.021950) ,
    (300, 0.071858) ,
    (400, 0.167052) ,
    (500, 0.359375) ,
    (600, 0.514655) ,
    (700, 1.078848) ,
    (800, 1.623547) ,
    (900, 1.866885) ,
    (1000, 3.375828) 
        ]


dots4 = [
    (100, 0.004686) ,
    (200, 0.020517) ,
    (300, 0.072764) ,
    (400, 0.193197) ,
    (500, 0.336189) ,
    (600, 0.565208) ,
    (700, 0.871256) ,
    (800, 1.520736) ,
    (900, 1.956819) ,
    (1000, 3.249451)
        ]

dots5 = [
    (100, 0.003124) ,
    (200, 0.009373) ,
    (300, 0.030551) ,
    (400, 0.110629) ,
    (500, 0.337126) ,
    (600, 0.550335) ,
    (700, 0.817949) ,
    (800, 1.639231) ,
    (900, 1.918839) ,
    (1000, 3.201328)
        ]

dots6 = [
    (100, 0.008229) ,
    (200, 0.023540) ,
    (300, 0.078456) ,
    (400, 0.167748) ,
    (500, 0.320277) ,
    (600, 0.562606) ,
    (700, 0.829360) ,
    (800, 1.399145) ,
    (900, 1.998846) ,
    (1000, 3.211190) 
        ]

dots7 = [
    (100, 0.005986) ,
    (200, 0.012497) ,
    (300, 0.033011) ,
    (400, 0.174363) ,
    (500, 0.345026) ,
    (600, 0.549828) ,
    (700, 0.805561) ,
    (800, 1.602442) ,
    (900, 2.033383) ,
    (1000, 3.145803)
         ]

x = [dots0[i][0] for i in range(len(dots0))] # string len
y = [dots0[i][1] for i in range(len(dots0))] 
y1 = [dots1[i][1] for i in range(len(dots1))] #time
y2 = [dots2[i][1] for i in range(len(dots2))] #time
y3 = [dots3[i][1] for i in range(len(dots3))] #time
y4 = [dots4[i][1] for i in range(len(dots4))] #time
y5 = [dots5[i][1] for i in range(len(dots5))] #time
y6 = [dots6[i][1] for i in range(len(dots6))] #time
y7 = [dots7[i][1] for i in range(len(dots7))]
# y8 = [dots8[i][1] for i in range(len(dots8))]

xlabels = [str(i) for i in x]

fig, ax = plt.subplots()

ax.set_xticks(x)
ax.set_xticklabels(xlabels)

# ax.plot(x, y, color = 'y', label="1 поток")
# ax.plot(x, y1, color = 'r', label="2 потока") # label для легенды 
# ax.plot(x, y2, color = 'b', label="4 потока")
# ax.plot(x, y3, color = 'g', label="8 потока")
# ax.plot(x, y4, color = 'y', label="16 потоков")
# ax.plot(x, y5, color = 'c', label="32 потока")
# ax.plot(x, y6, color = 'm', label="64 потока")
ax.plot(x, y7, color = 'm', label="128 потоков")
# ax.plot(x, y7, color = 'm', label="256 потоков")


plt.grid(True)

ax.set_ylabel('Время, с')
ax.set_xlabel('Размер матрицы')

ax.legend() 
plt.show()
