import matplotlib.pyplot as plt
import numpy as np

dots0 = [
    (101, 0.0044) ,
    (201, 0.0326) ,
    (301, 0.1234) ,
    (401, 0.2896) ,
    (501, 0.5898) ,
    (601, 1.0306) ,
    (701, 1.7386) ,
    (801, 2.7242) ,
    (901, 3.5614) ,
    (1001, 6.2808) 
         ]

dots1 = [
    (101, 0.001562) ,
    (201, 0.025395) ,
    (301, 0.073246) ,
    (401, 0.151410) ,
    (501, 0.311153) ,
    (601, 0.543242) ,
    (701, 1.132124) ,
    (801, 1.695274) ,
    (901, 2.414599) ,
    (1001, 4.262523) 
         ]

dots2 = [
    (101, 0.001001) ,
    (201, 0.016273) ,
    (301, 0.045437) ,
    (401, 0.234567) ,
    (501, 0.312384) ,
    (601, 0.565825) ,
    (701, 0.952443) ,
    (801, 1.430629) ,
    (901, 1.764874) ,
    (1001, 2.770515)
       ]

dots3 = [
    (101, 0.001562) ,
    (201, 0.009372) ,
    (301, 0.028324) ,
    (401, 0.139186) ,
    (501, 0.346033) ,
    (601, 0.580393) ,
    (701, 0.976953) ,
    (801, 1.274719) ,
    (901, 1.922012) ,
    (1001, 3.147265) 
        ]


dots4 = [
    (101, 0.004687) ,
    (201, 0.020414) ,
    (301, 0.081273) ,
    (401, 0.166905) ,
    (501, 0.352966) ,
    (601, 0.496522) ,
    (701, 1.125577) ,
    (801, 1.483663) ,
    (901, 1.836015) ,
    (1001, 3.280454)
         ]

dots5 = [
    (101, 0.004687) ,
    (201, 0.023432) ,
    (301, 0.082884) ,
    (401, 0.178702) ,
    (501, 0.350416) ,
    (601, 0.469337) ,
    (701, 0.856836) ,
    (801, 1.550254) ,
    (901, 1.963712) ,
    (1001, 3.278577)
         ]

dots6 = [
    (101, 0.003124) ,
    (201, 0.011039) ,
    (301, 0.057448) ,
    (401, 0.179068) ,
    (501, 0.356997) ,
    (601, 0.561073) ,
    (701, 0.950144) ,
    (801, 1.492872) ,
    (901, 1.935281) ,
    (1001, 3.396611)
         ]

dots7 = [
    (101, 0.015621) ,
    (201, 0.026556) ,
    (301, 0.091515) ,
    (401, 0.178774) ,
    (501, 0.428061) ,
    (601, 0.460292) ,
    (701, 1.010928) ,
    (801, 1.322703) ,
    (901, 1.843013) ,
    (1001, 3.286846)
         ]

x = [dots0[i][0] for i in range(len(dots0))] # string len
y = [dots0[i][1] for i in range(len(dots0))] 
y1 = [dots1[i][1] for i in range(len(dots1))] #time
y2 = [dots2[i][1] for i in range(len(dots2))] #time
y3 = [dots3[i][1] for i in range(len(dots3))] #time
y4 = [dots4[i][1] for i in range(len(dots4))] #time
y5 = [dots5[i][1] for i in range(len(dots5))] #time
y6 = [dots6[i][1] for i in range(len(dots6))] #time
y7 = [dots7[i][1] for i in range(len(dots7))]
# y8 = [dots8[i][1] for i in range(len(dots8))]


xlabels = [str(i) for i in x]

fig, ax = plt.subplots()

ax.set_xticks(x)
ax.set_xticklabels(xlabels)


# ax.plot(x, y, color = 'y', label="1 поток")
# ax.plot(x, y1, color = 'r', label="2 потока") # label для легенды 
# ax.plot(x, y2, color = 'b', label="4 потока")
# ax.plot(x, y3, color = 'g', label="8 потока")
# ax.plot(x, y4, color = 'y', label="16 потоков")
ax.plot(x, y5, color = 'c', label="32 потока")
ax.plot(x, y6, color = 'm', label="64 потока")
# ax.plot(x, y7, color = 'm', label="128 потоков")
# ax.plot(x, y7, color = 'm', label="256 потоков")

plt.grid(True)

ax.set_ylabel('Время, с')
ax.set_xlabel('Размер матрицы, б')

ax.legend() 
plt.show()
